Anas388800/stm32/tests/build/test/mocks/test_start_servo_control_task/mock_stm32f4xx_hal_uart.h
/* AUTOGENERATED FILE. DO NOT EDIT. */
#ifndef _MOCK_STM32F4XX_HAL_UART_H
#define _MOCK_STM32F4XX_HAL_UART_H

#include "unity.h"
#include "stm32f4xx_hal_uart.h"

/* Ignore the following warnings, since we are copying code */
#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic push
#endif
#if !defined(__clang__)
#pragma GCC diagnostic ignored "-Wpragmas"
#endif
#pragma GCC diagnostic ignored "-Wunknown-pragmas"
#pragma GCC diagnostic ignored "-Wduplicate-decl-specifier"
#endif

#ifdef __cplusplus
extern "C" {
#endif

void mock_stm32f4xx_hal_uart_Init(void);
void mock_stm32f4xx_hal_uart_Destroy(void);
void mock_stm32f4xx_hal_uart_Verify(void);




#define HAL_UART_Init_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Init requires _IgnoreAndReturn");
#define HAL_UART_Init_IgnoreAndReturn(cmock_retval) HAL_UART_Init_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Init_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Init_StopIgnore() HAL_UART_Init_CMockStopIgnore()
void HAL_UART_Init_CMockStopIgnore(void);
#define HAL_UART_Init_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_Init requires _ExpectAndReturn");
#define HAL_UART_Init_ExpectAndReturn(huart, cmock_retval) HAL_UART_Init_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_Init_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Init_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_Init_AddCallback(CMOCK_HAL_UART_Init_CALLBACK Callback);
void HAL_UART_Init_Stub(CMOCK_HAL_UART_Init_CALLBACK Callback);
#define HAL_UART_Init_StubWithCallback HAL_UART_Init_Stub
#define HAL_HalfDuplex_Init_Ignore() TEST_FAIL_MESSAGE("HAL_HalfDuplex_Init requires _IgnoreAndReturn");
#define HAL_HalfDuplex_Init_IgnoreAndReturn(cmock_retval) HAL_HalfDuplex_Init_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_HalfDuplex_Init_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_HalfDuplex_Init_StopIgnore() HAL_HalfDuplex_Init_CMockStopIgnore()
void HAL_HalfDuplex_Init_CMockStopIgnore(void);
#define HAL_HalfDuplex_Init_Expect(huart) TEST_FAIL_MESSAGE("HAL_HalfDuplex_Init requires _ExpectAndReturn");
#define HAL_HalfDuplex_Init_ExpectAndReturn(huart, cmock_retval) HAL_HalfDuplex_Init_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_HalfDuplex_Init_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_HalfDuplex_Init_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_HalfDuplex_Init_AddCallback(CMOCK_HAL_HalfDuplex_Init_CALLBACK Callback);
void HAL_HalfDuplex_Init_Stub(CMOCK_HAL_HalfDuplex_Init_CALLBACK Callback);
#define HAL_HalfDuplex_Init_StubWithCallback HAL_HalfDuplex_Init_Stub
#define HAL_LIN_Init_Ignore() TEST_FAIL_MESSAGE("HAL_LIN_Init requires _IgnoreAndReturn");
#define HAL_LIN_Init_IgnoreAndReturn(cmock_retval) HAL_LIN_Init_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_LIN_Init_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_LIN_Init_StopIgnore() HAL_LIN_Init_CMockStopIgnore()
void HAL_LIN_Init_CMockStopIgnore(void);
#define HAL_LIN_Init_Expect(huart, BreakDetectLength) TEST_FAIL_MESSAGE("HAL_LIN_Init requires _ExpectAndReturn");
#define HAL_LIN_Init_ExpectAndReturn(huart, BreakDetectLength, cmock_retval) HAL_LIN_Init_CMockExpectAndReturn(__LINE__, huart, BreakDetectLength, cmock_retval)
void HAL_LIN_Init_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint32_t BreakDetectLength, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_LIN_Init_CALLBACK)(UART_HandleTypeDef* huart, uint32_t BreakDetectLength, int cmock_num_calls);
void HAL_LIN_Init_AddCallback(CMOCK_HAL_LIN_Init_CALLBACK Callback);
void HAL_LIN_Init_Stub(CMOCK_HAL_LIN_Init_CALLBACK Callback);
#define HAL_LIN_Init_StubWithCallback HAL_LIN_Init_Stub
#define HAL_MultiProcessor_Init_Ignore() TEST_FAIL_MESSAGE("HAL_MultiProcessor_Init requires _IgnoreAndReturn");
#define HAL_MultiProcessor_Init_IgnoreAndReturn(cmock_retval) HAL_MultiProcessor_Init_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_MultiProcessor_Init_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_MultiProcessor_Init_StopIgnore() HAL_MultiProcessor_Init_CMockStopIgnore()
void HAL_MultiProcessor_Init_CMockStopIgnore(void);
#define HAL_MultiProcessor_Init_Expect(huart, Address, WakeUpMethod) TEST_FAIL_MESSAGE("HAL_MultiProcessor_Init requires _ExpectAndReturn");
#define HAL_MultiProcessor_Init_ExpectAndReturn(huart, Address, WakeUpMethod, cmock_retval) HAL_MultiProcessor_Init_CMockExpectAndReturn(__LINE__, huart, Address, WakeUpMethod, cmock_retval)
void HAL_MultiProcessor_Init_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t Address, uint32_t WakeUpMethod, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_MultiProcessor_Init_CALLBACK)(UART_HandleTypeDef* huart, uint8_t Address, uint32_t WakeUpMethod, int cmock_num_calls);
void HAL_MultiProcessor_Init_AddCallback(CMOCK_HAL_MultiProcessor_Init_CALLBACK Callback);
void HAL_MultiProcessor_Init_Stub(CMOCK_HAL_MultiProcessor_Init_CALLBACK Callback);
#define HAL_MultiProcessor_Init_StubWithCallback HAL_MultiProcessor_Init_Stub
#define HAL_UART_DeInit_Ignore() TEST_FAIL_MESSAGE("HAL_UART_DeInit requires _IgnoreAndReturn");
#define HAL_UART_DeInit_IgnoreAndReturn(cmock_retval) HAL_UART_DeInit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_DeInit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_DeInit_StopIgnore() HAL_UART_DeInit_CMockStopIgnore()
void HAL_UART_DeInit_CMockStopIgnore(void);
#define HAL_UART_DeInit_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_DeInit requires _ExpectAndReturn");
#define HAL_UART_DeInit_ExpectAndReturn(huart, cmock_retval) HAL_UART_DeInit_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_DeInit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_DeInit_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_DeInit_AddCallback(CMOCK_HAL_UART_DeInit_CALLBACK Callback);
void HAL_UART_DeInit_Stub(CMOCK_HAL_UART_DeInit_CALLBACK Callback);
#define HAL_UART_DeInit_StubWithCallback HAL_UART_DeInit_Stub
#define HAL_UART_MspInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_MspInit requires _Ignore (not AndReturn)");
#define HAL_UART_MspInit_Ignore() HAL_UART_MspInit_CMockIgnore()
void HAL_UART_MspInit_CMockIgnore(void);
#define HAL_UART_MspInit_StopIgnore() HAL_UART_MspInit_CMockStopIgnore()
void HAL_UART_MspInit_CMockStopIgnore(void);
#define HAL_UART_MspInit_ExpectAndReturn(huart, cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_MspInit requires _Expect (not AndReturn)");
#define HAL_UART_MspInit_Expect(huart) HAL_UART_MspInit_CMockExpect(__LINE__, huart)
void HAL_UART_MspInit_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart);
typedef void (* CMOCK_HAL_UART_MspInit_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_MspInit_AddCallback(CMOCK_HAL_UART_MspInit_CALLBACK Callback);
void HAL_UART_MspInit_Stub(CMOCK_HAL_UART_MspInit_CALLBACK Callback);
#define HAL_UART_MspInit_StubWithCallback HAL_UART_MspInit_Stub
#define HAL_UART_MspDeInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_MspDeInit requires _Ignore (not AndReturn)");
#define HAL_UART_MspDeInit_Ignore() HAL_UART_MspDeInit_CMockIgnore()
void HAL_UART_MspDeInit_CMockIgnore(void);
#define HAL_UART_MspDeInit_StopIgnore() HAL_UART_MspDeInit_CMockStopIgnore()
void HAL_UART_MspDeInit_CMockStopIgnore(void);
#define HAL_UART_MspDeInit_ExpectAndReturn(huart, cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_MspDeInit requires _Expect (not AndReturn)");
#define HAL_UART_MspDeInit_Expect(huart) HAL_UART_MspDeInit_CMockExpect(__LINE__, huart)
void HAL_UART_MspDeInit_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart);
typedef void (* CMOCK_HAL_UART_MspDeInit_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_MspDeInit_AddCallback(CMOCK_HAL_UART_MspDeInit_CALLBACK Callback);
void HAL_UART_MspDeInit_Stub(CMOCK_HAL_UART_MspDeInit_CALLBACK Callback);
#define HAL_UART_MspDeInit_StubWithCallback HAL_UART_MspDeInit_Stub
#define HAL_UART_RegisterCallback_Ignore() TEST_FAIL_MESSAGE("HAL_UART_RegisterCallback requires _IgnoreAndReturn");
#define HAL_UART_RegisterCallback_IgnoreAndReturn(cmock_retval) HAL_UART_RegisterCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_RegisterCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_RegisterCallback_StopIgnore() HAL_UART_RegisterCallback_CMockStopIgnore()
void HAL_UART_RegisterCallback_CMockStopIgnore(void);
#define HAL_UART_RegisterCallback_Expect(huart, CallbackID, pCallback) TEST_FAIL_MESSAGE("HAL_UART_RegisterCallback requires _ExpectAndReturn");
#define HAL_UART_RegisterCallback_ExpectAndReturn(huart, CallbackID, pCallback, cmock_retval) HAL_UART_RegisterCallback_CMockExpectAndReturn(__LINE__, huart, CallbackID, pCallback, cmock_retval)
void HAL_UART_RegisterCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_UART_CallbackIDTypeDef CallbackID, pUART_CallbackTypeDef pCallback, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_RegisterCallback_CALLBACK)(UART_HandleTypeDef* huart, HAL_UART_CallbackIDTypeDef CallbackID, pUART_CallbackTypeDef pCallback, int cmock_num_calls);
void HAL_UART_RegisterCallback_AddCallback(CMOCK_HAL_UART_RegisterCallback_CALLBACK Callback);
void HAL_UART_RegisterCallback_Stub(CMOCK_HAL_UART_RegisterCallback_CALLBACK Callback);
#define HAL_UART_RegisterCallback_StubWithCallback HAL_UART_RegisterCallback_Stub
#define HAL_UART_UnRegisterCallback_Ignore() TEST_FAIL_MESSAGE("HAL_UART_UnRegisterCallback requires _IgnoreAndReturn");
#define HAL_UART_UnRegisterCallback_IgnoreAndReturn(cmock_retval) HAL_UART_UnRegisterCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_UnRegisterCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_UnRegisterCallback_StopIgnore() HAL_UART_UnRegisterCallback_CMockStopIgnore()
void HAL_UART_UnRegisterCallback_CMockStopIgnore(void);
#define HAL_UART_UnRegisterCallback_Expect(huart, CallbackID) TEST_FAIL_MESSAGE("HAL_UART_UnRegisterCallback requires _ExpectAndReturn");
#define HAL_UART_UnRegisterCallback_ExpectAndReturn(huart, CallbackID, cmock_retval) HAL_UART_UnRegisterCallback_CMockExpectAndReturn(__LINE__, huart, CallbackID, cmock_retval)
void HAL_UART_UnRegisterCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_UART_CallbackIDTypeDef CallbackID, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_UnRegisterCallback_CALLBACK)(UART_HandleTypeDef* huart, HAL_UART_CallbackIDTypeDef CallbackID, int cmock_num_calls);
void HAL_UART_UnRegisterCallback_AddCallback(CMOCK_HAL_UART_UnRegisterCallback_CALLBACK Callback);
void HAL_UART_UnRegisterCallback_Stub(CMOCK_HAL_UART_UnRegisterCallback_CALLBACK Callback);
#define HAL_UART_UnRegisterCallback_StubWithCallback HAL_UART_UnRegisterCallback_Stub
#define HAL_UART_RegisterRxEventCallback_Ignore() TEST_FAIL_MESSAGE("HAL_UART_RegisterRxEventCallback requires _IgnoreAndReturn");
#define HAL_UART_RegisterRxEventCallback_IgnoreAndReturn(cmock_retval) HAL_UART_RegisterRxEventCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_RegisterRxEventCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_RegisterRxEventCallback_StopIgnore() HAL_UART_RegisterRxEventCallback_CMockStopIgnore()
void HAL_UART_RegisterRxEventCallback_CMockStopIgnore(void);
#define HAL_UART_RegisterRxEventCallback_Expect(huart, pCallback) TEST_FAIL_MESSAGE("HAL_UART_RegisterRxEventCallback requires _ExpectAndReturn");
#define HAL_UART_RegisterRxEventCallback_ExpectAndReturn(huart, pCallback, cmock_retval) HAL_UART_RegisterRxEventCallback_CMockExpectAndReturn(__LINE__, huart, pCallback, cmock_retval)
void HAL_UART_RegisterRxEventCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, pUART_RxEventCallbackTypeDef pCallback, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_RegisterRxEventCallback_CALLBACK)(UART_HandleTypeDef* huart, pUART_RxEventCallbackTypeDef pCallback, int cmock_num_calls);
void HAL_UART_RegisterRxEventCallback_AddCallback(CMOCK_HAL_UART_RegisterRxEventCallback_CALLBACK Callback);
void HAL_UART_RegisterRxEventCallback_Stub(CMOCK_HAL_UART_RegisterRxEventCallback_CALLBACK Callback);
#define HAL_UART_RegisterRxEventCallback_StubWithCallback HAL_UART_RegisterRxEventCallback_Stub
#define HAL_UART_UnRegisterRxEventCallback_Ignore() TEST_FAIL_MESSAGE("HAL_UART_UnRegisterRxEventCallback requires _IgnoreAndReturn");
#define HAL_UART_UnRegisterRxEventCallback_IgnoreAndReturn(cmock_retval) HAL_UART_UnRegisterRxEventCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_UnRegisterRxEventCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_UnRegisterRxEventCallback_StopIgnore() HAL_UART_UnRegisterRxEventCallback_CMockStopIgnore()
void HAL_UART_UnRegisterRxEventCallback_CMockStopIgnore(void);
#define HAL_UART_UnRegisterRxEventCallback_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_UnRegisterRxEventCallback requires _ExpectAndReturn");
#define HAL_UART_UnRegisterRxEventCallback_ExpectAndReturn(huart, cmock_retval) HAL_UART_UnRegisterRxEventCallback_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_UnRegisterRxEventCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_UnRegisterRxEventCallback_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_UnRegisterRxEventCallback_AddCallback(CMOCK_HAL_UART_UnRegisterRxEventCallback_CALLBACK Callback);
void HAL_UART_UnRegisterRxEventCallback_Stub(CMOCK_HAL_UART_UnRegisterRxEventCallback_CALLBACK Callback);
#define HAL_UART_UnRegisterRxEventCallback_StubWithCallback HAL_UART_UnRegisterRxEventCallback_Stub
#define HAL_UART_Transmit_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Transmit requires _IgnoreAndReturn");
#define HAL_UART_Transmit_IgnoreAndReturn(cmock_retval) HAL_UART_Transmit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Transmit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Transmit_StopIgnore() HAL_UART_Transmit_CMockStopIgnore()
void HAL_UART_Transmit_CMockStopIgnore(void);
#define HAL_UART_Transmit_Expect(huart, pData, Size, Timeout) TEST_FAIL_MESSAGE("HAL_UART_Transmit requires _ExpectAndReturn");
#define HAL_UART_Transmit_ExpectAndReturn(huart, pData, Size, Timeout, cmock_retval) HAL_UART_Transmit_CMockExpectAndReturn(__LINE__, huart, pData, Size, Timeout, cmock_retval)
void HAL_UART_Transmit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, const uint8_t* pData, uint16_t Size, uint32_t Timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Transmit_CALLBACK)(UART_HandleTypeDef* huart, const uint8_t* pData, uint16_t Size, uint32_t Timeout, int cmock_num_calls);
void HAL_UART_Transmit_AddCallback(CMOCK_HAL_UART_Transmit_CALLBACK Callback);
void HAL_UART_Transmit_Stub(CMOCK_HAL_UART_Transmit_CALLBACK Callback);
#define HAL_UART_Transmit_StubWithCallback HAL_UART_Transmit_Stub
#define HAL_UART_Receive_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Receive requires _IgnoreAndReturn");
#define HAL_UART_Receive_IgnoreAndReturn(cmock_retval) HAL_UART_Receive_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Receive_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Receive_StopIgnore() HAL_UART_Receive_CMockStopIgnore()
void HAL_UART_Receive_CMockStopIgnore(void);
#define HAL_UART_Receive_Expect(huart, pData, Size, Timeout) TEST_FAIL_MESSAGE("HAL_UART_Receive requires _ExpectAndReturn");
#define HAL_UART_Receive_ExpectAndReturn(huart, pData, Size, Timeout, cmock_retval) HAL_UART_Receive_CMockExpectAndReturn(__LINE__, huart, pData, Size, Timeout, cmock_retval)
void HAL_UART_Receive_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, uint32_t Timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Receive_CALLBACK)(UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, uint32_t Timeout, int cmock_num_calls);
void HAL_UART_Receive_AddCallback(CMOCK_HAL_UART_Receive_CALLBACK Callback);
void HAL_UART_Receive_Stub(CMOCK_HAL_UART_Receive_CALLBACK Callback);
#define HAL_UART_Receive_StubWithCallback HAL_UART_Receive_Stub
#define HAL_UART_Transmit_IT_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Transmit_IT requires _IgnoreAndReturn");
#define HAL_UART_Transmit_IT_IgnoreAndReturn(cmock_retval) HAL_UART_Transmit_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Transmit_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Transmit_IT_StopIgnore() HAL_UART_Transmit_IT_CMockStopIgnore()
void HAL_UART_Transmit_IT_CMockStopIgnore(void);
#define HAL_UART_Transmit_IT_Expect(huart, pData, Size) TEST_FAIL_MESSAGE("HAL_UART_Transmit_IT requires _ExpectAndReturn");
#define HAL_UART_Transmit_IT_ExpectAndReturn(huart, pData, Size, cmock_retval) HAL_UART_Transmit_IT_CMockExpectAndReturn(__LINE__, huart, pData, Size, cmock_retval)
void HAL_UART_Transmit_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, const uint8_t* pData, uint16_t Size, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Transmit_IT_CALLBACK)(UART_HandleTypeDef* huart, const uint8_t* pData, uint16_t Size, int cmock_num_calls);
void HAL_UART_Transmit_IT_AddCallback(CMOCK_HAL_UART_Transmit_IT_CALLBACK Callback);
void HAL_UART_Transmit_IT_Stub(CMOCK_HAL_UART_Transmit_IT_CALLBACK Callback);
#define HAL_UART_Transmit_IT_StubWithCallback HAL_UART_Transmit_IT_Stub
#define HAL_UART_Receive_IT_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Receive_IT requires _IgnoreAndReturn");
#define HAL_UART_Receive_IT_IgnoreAndReturn(cmock_retval) HAL_UART_Receive_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Receive_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Receive_IT_StopIgnore() HAL_UART_Receive_IT_CMockStopIgnore()
void HAL_UART_Receive_IT_CMockStopIgnore(void);
#define HAL_UART_Receive_IT_Expect(huart, pData, Size) TEST_FAIL_MESSAGE("HAL_UART_Receive_IT requires _ExpectAndReturn");
#define HAL_UART_Receive_IT_ExpectAndReturn(huart, pData, Size, cmock_retval) HAL_UART_Receive_IT_CMockExpectAndReturn(__LINE__, huart, pData, Size, cmock_retval)
void HAL_UART_Receive_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Receive_IT_CALLBACK)(UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, int cmock_num_calls);
void HAL_UART_Receive_IT_AddCallback(CMOCK_HAL_UART_Receive_IT_CALLBACK Callback);
void HAL_UART_Receive_IT_Stub(CMOCK_HAL_UART_Receive_IT_CALLBACK Callback);
#define HAL_UART_Receive_IT_StubWithCallback HAL_UART_Receive_IT_Stub
#define HAL_UART_Transmit_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Transmit_DMA requires _IgnoreAndReturn");
#define HAL_UART_Transmit_DMA_IgnoreAndReturn(cmock_retval) HAL_UART_Transmit_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Transmit_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Transmit_DMA_StopIgnore() HAL_UART_Transmit_DMA_CMockStopIgnore()
void HAL_UART_Transmit_DMA_CMockStopIgnore(void);
#define HAL_UART_Transmit_DMA_Expect(huart, pData, Size) TEST_FAIL_MESSAGE("HAL_UART_Transmit_DMA requires _ExpectAndReturn");
#define HAL_UART_Transmit_DMA_ExpectAndReturn(huart, pData, Size, cmock_retval) HAL_UART_Transmit_DMA_CMockExpectAndReturn(__LINE__, huart, pData, Size, cmock_retval)
void HAL_UART_Transmit_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, const uint8_t* pData, uint16_t Size, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Transmit_DMA_CALLBACK)(UART_HandleTypeDef* huart, const uint8_t* pData, uint16_t Size, int cmock_num_calls);
void HAL_UART_Transmit_DMA_AddCallback(CMOCK_HAL_UART_Transmit_DMA_CALLBACK Callback);
void HAL_UART_Transmit_DMA_Stub(CMOCK_HAL_UART_Transmit_DMA_CALLBACK Callback);
#define HAL_UART_Transmit_DMA_StubWithCallback HAL_UART_Transmit_DMA_Stub
#define HAL_UART_Receive_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Receive_DMA requires _IgnoreAndReturn");
#define HAL_UART_Receive_DMA_IgnoreAndReturn(cmock_retval) HAL_UART_Receive_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Receive_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Receive_DMA_StopIgnore() HAL_UART_Receive_DMA_CMockStopIgnore()
void HAL_UART_Receive_DMA_CMockStopIgnore(void);
#define HAL_UART_Receive_DMA_Expect(huart, pData, Size) TEST_FAIL_MESSAGE("HAL_UART_Receive_DMA requires _ExpectAndReturn");
#define HAL_UART_Receive_DMA_ExpectAndReturn(huart, pData, Size, cmock_retval) HAL_UART_Receive_DMA_CMockExpectAndReturn(__LINE__, huart, pData, Size, cmock_retval)
void HAL_UART_Receive_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Receive_DMA_CALLBACK)(UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, int cmock_num_calls);
void HAL_UART_Receive_DMA_AddCallback(CMOCK_HAL_UART_Receive_DMA_CALLBACK Callback);
void HAL_UART_Receive_DMA_Stub(CMOCK_HAL_UART_Receive_DMA_CALLBACK Callback);
#define HAL_UART_Receive_DMA_StubWithCallback HAL_UART_Receive_DMA_Stub
#define HAL_UART_DMAPause_Ignore() TEST_FAIL_MESSAGE("HAL_UART_DMAPause requires _IgnoreAndReturn");
#define HAL_UART_DMAPause_IgnoreAndReturn(cmock_retval) HAL_UART_DMAPause_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_DMAPause_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_DMAPause_StopIgnore() HAL_UART_DMAPause_CMockStopIgnore()
void HAL_UART_DMAPause_CMockStopIgnore(void);
#define HAL_UART_DMAPause_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_DMAPause requires _ExpectAndReturn");
#define HAL_UART_DMAPause_ExpectAndReturn(huart, cmock_retval) HAL_UART_DMAPause_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_DMAPause_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_DMAPause_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_DMAPause_AddCallback(CMOCK_HAL_UART_DMAPause_CALLBACK Callback);
void HAL_UART_DMAPause_Stub(CMOCK_HAL_UART_DMAPause_CALLBACK Callback);
#define HAL_UART_DMAPause_StubWithCallback HAL_UART_DMAPause_Stub
#define HAL_UART_DMAResume_Ignore() TEST_FAIL_MESSAGE("HAL_UART_DMAResume requires _IgnoreAndReturn");
