Anas388800/stm32/tests/build/test/mocks/test_start_servo_control_task/mock_stm32f4xx_hal_uart.h
#define HAL_UART_DMAResume_IgnoreAndReturn(cmock_retval) HAL_UART_DMAResume_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_DMAResume_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_DMAResume_StopIgnore() HAL_UART_DMAResume_CMockStopIgnore()
void HAL_UART_DMAResume_CMockStopIgnore(void);
#define HAL_UART_DMAResume_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_DMAResume requires _ExpectAndReturn");
#define HAL_UART_DMAResume_ExpectAndReturn(huart, cmock_retval) HAL_UART_DMAResume_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_DMAResume_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_DMAResume_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_DMAResume_AddCallback(CMOCK_HAL_UART_DMAResume_CALLBACK Callback);
void HAL_UART_DMAResume_Stub(CMOCK_HAL_UART_DMAResume_CALLBACK Callback);
#define HAL_UART_DMAResume_StubWithCallback HAL_UART_DMAResume_Stub
#define HAL_UART_DMAStop_Ignore() TEST_FAIL_MESSAGE("HAL_UART_DMAStop requires _IgnoreAndReturn");
#define HAL_UART_DMAStop_IgnoreAndReturn(cmock_retval) HAL_UART_DMAStop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_DMAStop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_DMAStop_StopIgnore() HAL_UART_DMAStop_CMockStopIgnore()
void HAL_UART_DMAStop_CMockStopIgnore(void);
#define HAL_UART_DMAStop_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_DMAStop requires _ExpectAndReturn");
#define HAL_UART_DMAStop_ExpectAndReturn(huart, cmock_retval) HAL_UART_DMAStop_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_DMAStop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_DMAStop_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_DMAStop_AddCallback(CMOCK_HAL_UART_DMAStop_CALLBACK Callback);
void HAL_UART_DMAStop_Stub(CMOCK_HAL_UART_DMAStop_CALLBACK Callback);
#define HAL_UART_DMAStop_StubWithCallback HAL_UART_DMAStop_Stub
#define HAL_UARTEx_ReceiveToIdle_Ignore() TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle requires _IgnoreAndReturn");
#define HAL_UARTEx_ReceiveToIdle_IgnoreAndReturn(cmock_retval) HAL_UARTEx_ReceiveToIdle_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UARTEx_ReceiveToIdle_StopIgnore() HAL_UARTEx_ReceiveToIdle_CMockStopIgnore()
void HAL_UARTEx_ReceiveToIdle_CMockStopIgnore(void);
#define HAL_UARTEx_ReceiveToIdle_Expect(huart, pData, Size, RxLen, Timeout) TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle requires _ExpectAndReturn");
#define HAL_UARTEx_ReceiveToIdle_ExpectAndReturn(huart, pData, Size, RxLen, Timeout, cmock_retval) HAL_UARTEx_ReceiveToIdle_CMockExpectAndReturn(__LINE__, huart, pData, Size, RxLen, Timeout, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, uint16_t* RxLen, uint32_t Timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UARTEx_ReceiveToIdle_CALLBACK)(UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, uint16_t* RxLen, uint32_t Timeout, int cmock_num_calls);
void HAL_UARTEx_ReceiveToIdle_AddCallback(CMOCK_HAL_UARTEx_ReceiveToIdle_CALLBACK Callback);
void HAL_UARTEx_ReceiveToIdle_Stub(CMOCK_HAL_UARTEx_ReceiveToIdle_CALLBACK Callback);
#define HAL_UARTEx_ReceiveToIdle_StubWithCallback HAL_UARTEx_ReceiveToIdle_Stub
#define HAL_UARTEx_ReceiveToIdle_IT_Ignore() TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle_IT requires _IgnoreAndReturn");
#define HAL_UARTEx_ReceiveToIdle_IT_IgnoreAndReturn(cmock_retval) HAL_UARTEx_ReceiveToIdle_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UARTEx_ReceiveToIdle_IT_StopIgnore() HAL_UARTEx_ReceiveToIdle_IT_CMockStopIgnore()
void HAL_UARTEx_ReceiveToIdle_IT_CMockStopIgnore(void);
#define HAL_UARTEx_ReceiveToIdle_IT_Expect(huart, pData, Size) TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle_IT requires _ExpectAndReturn");
#define HAL_UARTEx_ReceiveToIdle_IT_ExpectAndReturn(huart, pData, Size, cmock_retval) HAL_UARTEx_ReceiveToIdle_IT_CMockExpectAndReturn(__LINE__, huart, pData, Size, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UARTEx_ReceiveToIdle_IT_CALLBACK)(UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, int cmock_num_calls);
void HAL_UARTEx_ReceiveToIdle_IT_AddCallback(CMOCK_HAL_UARTEx_ReceiveToIdle_IT_CALLBACK Callback);
void HAL_UARTEx_ReceiveToIdle_IT_Stub(CMOCK_HAL_UARTEx_ReceiveToIdle_IT_CALLBACK Callback);
#define HAL_UARTEx_ReceiveToIdle_IT_StubWithCallback HAL_UARTEx_ReceiveToIdle_IT_Stub
#define HAL_UARTEx_ReceiveToIdle_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle_DMA requires _IgnoreAndReturn");
#define HAL_UARTEx_ReceiveToIdle_DMA_IgnoreAndReturn(cmock_retval) HAL_UARTEx_ReceiveToIdle_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UARTEx_ReceiveToIdle_DMA_StopIgnore() HAL_UARTEx_ReceiveToIdle_DMA_CMockStopIgnore()
void HAL_UARTEx_ReceiveToIdle_DMA_CMockStopIgnore(void);
#define HAL_UARTEx_ReceiveToIdle_DMA_Expect(huart, pData, Size) TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle_DMA requires _ExpectAndReturn");
#define HAL_UARTEx_ReceiveToIdle_DMA_ExpectAndReturn(huart, pData, Size, cmock_retval) HAL_UARTEx_ReceiveToIdle_DMA_CMockExpectAndReturn(__LINE__, huart, pData, Size, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UARTEx_ReceiveToIdle_DMA_CALLBACK)(UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, int cmock_num_calls);
void HAL_UARTEx_ReceiveToIdle_DMA_AddCallback(CMOCK_HAL_UARTEx_ReceiveToIdle_DMA_CALLBACK Callback);
void HAL_UARTEx_ReceiveToIdle_DMA_Stub(CMOCK_HAL_UARTEx_ReceiveToIdle_DMA_CALLBACK Callback);
#define HAL_UARTEx_ReceiveToIdle_DMA_StubWithCallback HAL_UARTEx_ReceiveToIdle_DMA_Stub
#define HAL_UART_Abort_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Abort requires _IgnoreAndReturn");
#define HAL_UART_Abort_IgnoreAndReturn(cmock_retval) HAL_UART_Abort_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Abort_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Abort_StopIgnore() HAL_UART_Abort_CMockStopIgnore()
void HAL_UART_Abort_CMockStopIgnore(void);
#define HAL_UART_Abort_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_Abort requires _ExpectAndReturn");
#define HAL_UART_Abort_ExpectAndReturn(huart, cmock_retval) HAL_UART_Abort_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_Abort_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Abort_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_Abort_AddCallback(CMOCK_HAL_UART_Abort_CALLBACK Callback);
void HAL_UART_Abort_Stub(CMOCK_HAL_UART_Abort_CALLBACK Callback);
#define HAL_UART_Abort_StubWithCallback HAL_UART_Abort_Stub
#define HAL_UART_AbortTransmit_Ignore() TEST_FAIL_MESSAGE("HAL_UART_AbortTransmit requires _IgnoreAndReturn");
#define HAL_UART_AbortTransmit_IgnoreAndReturn(cmock_retval) HAL_UART_AbortTransmit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_AbortTransmit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_AbortTransmit_StopIgnore() HAL_UART_AbortTransmit_CMockStopIgnore()
void HAL_UART_AbortTransmit_CMockStopIgnore(void);
#define HAL_UART_AbortTransmit_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_AbortTransmit requires _ExpectAndReturn");
#define HAL_UART_AbortTransmit_ExpectAndReturn(huart, cmock_retval) HAL_UART_AbortTransmit_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_AbortTransmit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_AbortTransmit_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_AbortTransmit_AddCallback(CMOCK_HAL_UART_AbortTransmit_CALLBACK Callback);
void HAL_UART_AbortTransmit_Stub(CMOCK_HAL_UART_AbortTransmit_CALLBACK Callback);
#define HAL_UART_AbortTransmit_StubWithCallback HAL_UART_AbortTransmit_Stub
#define HAL_UART_AbortReceive_Ignore() TEST_FAIL_MESSAGE("HAL_UART_AbortReceive requires _IgnoreAndReturn");
#define HAL_UART_AbortReceive_IgnoreAndReturn(cmock_retval) HAL_UART_AbortReceive_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_AbortReceive_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_AbortReceive_StopIgnore() HAL_UART_AbortReceive_CMockStopIgnore()
void HAL_UART_AbortReceive_CMockStopIgnore(void);
#define HAL_UART_AbortReceive_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_AbortReceive requires _ExpectAndReturn");
#define HAL_UART_AbortReceive_ExpectAndReturn(huart, cmock_retval) HAL_UART_AbortReceive_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_AbortReceive_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_AbortReceive_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_AbortReceive_AddCallback(CMOCK_HAL_UART_AbortReceive_CALLBACK Callback);
void HAL_UART_AbortReceive_Stub(CMOCK_HAL_UART_AbortReceive_CALLBACK Callback);
#define HAL_UART_AbortReceive_StubWithCallback HAL_UART_AbortReceive_Stub
#define HAL_UART_Abort_IT_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Abort_IT requires _IgnoreAndReturn");
#define HAL_UART_Abort_IT_IgnoreAndReturn(cmock_retval) HAL_UART_Abort_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Abort_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Abort_IT_StopIgnore() HAL_UART_Abort_IT_CMockStopIgnore()
void HAL_UART_Abort_IT_CMockStopIgnore(void);
#define HAL_UART_Abort_IT_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_Abort_IT requires _ExpectAndReturn");
#define HAL_UART_Abort_IT_ExpectAndReturn(huart, cmock_retval) HAL_UART_Abort_IT_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_Abort_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Abort_IT_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_Abort_IT_AddCallback(CMOCK_HAL_UART_Abort_IT_CALLBACK Callback);
void HAL_UART_Abort_IT_Stub(CMOCK_HAL_UART_Abort_IT_CALLBACK Callback);
#define HAL_UART_Abort_IT_StubWithCallback HAL_UART_Abort_IT_Stub
#define HAL_UART_AbortTransmit_IT_Ignore() TEST_FAIL_MESSAGE("HAL_UART_AbortTransmit_IT requires _IgnoreAndReturn");
#define HAL_UART_AbortTransmit_IT_IgnoreAndReturn(cmock_retval) HAL_UART_AbortTransmit_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_AbortTransmit_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_AbortTransmit_IT_StopIgnore() HAL_UART_AbortTransmit_IT_CMockStopIgnore()
void HAL_UART_AbortTransmit_IT_CMockStopIgnore(void);
#define HAL_UART_AbortTransmit_IT_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_AbortTransmit_IT requires _ExpectAndReturn");
#define HAL_UART_AbortTransmit_IT_ExpectAndReturn(huart, cmock_retval) HAL_UART_AbortTransmit_IT_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_AbortTransmit_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_AbortTransmit_IT_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_AbortTransmit_IT_AddCallback(CMOCK_HAL_UART_AbortTransmit_IT_CALLBACK Callback);
void HAL_UART_AbortTransmit_IT_Stub(CMOCK_HAL_UART_AbortTransmit_IT_CALLBACK Callback);
#define HAL_UART_AbortTransmit_IT_StubWithCallback HAL_UART_AbortTransmit_IT_Stub
#define HAL_UART_AbortReceive_IT_Ignore() TEST_FAIL_MESSAGE("HAL_UART_AbortReceive_IT requires _IgnoreAndReturn");
#define HAL_UART_AbortReceive_IT_IgnoreAndReturn(cmock_retval) HAL_UART_AbortReceive_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_AbortReceive_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_AbortReceive_IT_StopIgnore() HAL_UART_AbortReceive_IT_CMockStopIgnore()
void HAL_UART_AbortReceive_IT_CMockStopIgnore(void);
#define HAL_UART_AbortReceive_IT_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_AbortReceive_IT requires _ExpectAndReturn");
#define HAL_UART_AbortReceive_IT_ExpectAndReturn(huart, cmock_retval) HAL_UART_AbortReceive_IT_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_AbortReceive_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_AbortReceive_IT_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_AbortReceive_IT_AddCallback(CMOCK_HAL_UART_AbortReceive_IT_CALLBACK Callback);
void HAL_UART_AbortReceive_IT_Stub(CMOCK_HAL_UART_AbortReceive_IT_CALLBACK Callback);
#define HAL_UART_AbortReceive_IT_StubWithCallback HAL_UART_AbortReceive_IT_Stub
#define HAL_UART_IRQHandler_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_IRQHandler requires _Ignore (not AndReturn)");
#define HAL_UART_IRQHandler_Ignore() HAL_UART_IRQHandler_CMockIgnore()
void HAL_UART_IRQHandler_CMockIgnore(void);
#define HAL_UART_IRQHandler_StopIgnore() HAL_UART_IRQHandler_CMockStopIgnore()
void HAL_UART_IRQHandler_CMockStopIgnore(void);
#define HAL_UART_IRQHandler_ExpectAndReturn(huart, cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_IRQHandler requires _Expect (not AndReturn)");
#define HAL_UART_IRQHandler_Expect(huart) HAL_UART_IRQHandler_CMockExpect(__LINE__, huart)
void HAL_UART_IRQHandler_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart);
typedef void (* CMOCK_HAL_UART_IRQHandler_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_IRQHandler_AddCallback(CMOCK_HAL_UART_IRQHandler_CALLBACK Callback);
void HAL_UART_IRQHandler_Stub(CMOCK_HAL_UART_IRQHandler_CALLBACK Callback);
#define HAL_UART_IRQHandler_StubWithCallback HAL_UART_IRQHandler_Stub
#define HAL_UART_TxCpltCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_TxCpltCallback requires _Ignore (not AndReturn)");
#define HAL_UART_TxCpltCallback_Ignore() HAL_UART_TxCpltCallback_CMockIgnore()
void HAL_UART_TxCpltCallback_CMockIgnore(void);
#define HAL_UART_TxCpltCallback_StopIgnore() HAL_UART_TxCpltCallback_CMockStopIgnore()
void HAL_UART_TxCpltCallback_CMockStopIgnore(void);
#define HAL_UART_TxCpltCallback_ExpectAndReturn(huart, cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_TxCpltCallback requires _Expect (not AndReturn)");
#define HAL_UART_TxCpltCallback_Expect(huart) HAL_UART_TxCpltCallback_CMockExpect(__LINE__, huart)
void HAL_UART_TxCpltCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart);
typedef void (* CMOCK_HAL_UART_TxCpltCallback_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_TxCpltCallback_AddCallback(CMOCK_HAL_UART_TxCpltCallback_CALLBACK Callback);
void HAL_UART_TxCpltCallback_Stub(CMOCK_HAL_UART_TxCpltCallback_CALLBACK Callback);
#define HAL_UART_TxCpltCallback_StubWithCallback HAL_UART_TxCpltCallback_Stub
#define HAL_UART_TxHalfCpltCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_TxHalfCpltCallback requires _Ignore (not AndReturn)");
#define HAL_UART_TxHalfCpltCallback_Ignore() HAL_UART_TxHalfCpltCallback_CMockIgnore()
void HAL_UART_TxHalfCpltCallback_CMockIgnore(void);
#define HAL_UART_TxHalfCpltCallback_StopIgnore() HAL_UART_TxHalfCpltCallback_CMockStopIgnore()
void HAL_UART_TxHalfCpltCallback_CMockStopIgnore(void);
#define HAL_UART_TxHalfCpltCallback_ExpectAndReturn(huart, cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_TxHalfCpltCallback requires _Expect (not AndReturn)");
#define HAL_UART_TxHalfCpltCallback_Expect(huart) HAL_UART_TxHalfCpltCallback_CMockExpect(__LINE__, huart)
void HAL_UART_TxHalfCpltCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart);
typedef void (* CMOCK_HAL_UART_TxHalfCpltCallback_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_TxHalfCpltCallback_AddCallback(CMOCK_HAL_UART_TxHalfCpltCallback_CALLBACK Callback);
void HAL_UART_TxHalfCpltCallback_Stub(CMOCK_HAL_UART_TxHalfCpltCallback_CALLBACK Callback);
#define HAL_UART_TxHalfCpltCallback_StubWithCallback HAL_UART_TxHalfCpltCallback_Stub
#define HAL_UART_RxCpltCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_RxCpltCallback requires _Ignore (not AndReturn)");
#define HAL_UART_RxCpltCallback_Ignore() HAL_UART_RxCpltCallback_CMockIgnore()
void HAL_UART_RxCpltCallback_CMockIgnore(void);
#define HAL_UART_RxCpltCallback_StopIgnore() HAL_UART_RxCpltCallback_CMockStopIgnore()
void HAL_UART_RxCpltCallback_CMockStopIgnore(void);
#define HAL_UART_RxCpltCallback_ExpectAndReturn(huart, cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_RxCpltCallback requires _Expect (not AndReturn)");
#define HAL_UART_RxCpltCallback_Expect(huart) HAL_UART_RxCpltCallback_CMockExpect(__LINE__, huart)
void HAL_UART_RxCpltCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart);
typedef void (* CMOCK_HAL_UART_RxCpltCallback_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_RxCpltCallback_AddCallback(CMOCK_HAL_UART_RxCpltCallback_CALLBACK Callback);
void HAL_UART_RxCpltCallback_Stub(CMOCK_HAL_UART_RxCpltCallback_CALLBACK Callback);
#define HAL_UART_RxCpltCallback_StubWithCallback HAL_UART_RxCpltCallback_Stub
#define HAL_UART_RxHalfCpltCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_RxHalfCpltCallback requires _Ignore (not AndReturn)");
#define HAL_UART_RxHalfCpltCallback_Ignore() HAL_UART_RxHalfCpltCallback_CMockIgnore()
void HAL_UART_RxHalfCpltCallback_CMockIgnore(void);
#define HAL_UART_RxHalfCpltCallback_StopIgnore() HAL_UART_RxHalfCpltCallback_CMockStopIgnore()
void HAL_UART_RxHalfCpltCallback_CMockStopIgnore(void);
#define HAL_UART_RxHalfCpltCallback_ExpectAndReturn(huart, cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_RxHalfCpltCallback requires _Expect (not AndReturn)");
#define HAL_UART_RxHalfCpltCallback_Expect(huart) HAL_UART_RxHalfCpltCallback_CMockExpect(__LINE__, huart)
void HAL_UART_RxHalfCpltCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart);
typedef void (* CMOCK_HAL_UART_RxHalfCpltCallback_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_RxHalfCpltCallback_AddCallback(CMOCK_HAL_UART_RxHalfCpltCallback_CALLBACK Callback);
void HAL_UART_RxHalfCpltCallback_Stub(CMOCK_HAL_UART_RxHalfCpltCallback_CALLBACK Callback);
#define HAL_UART_RxHalfCpltCallback_StubWithCallback HAL_UART_RxHalfCpltCallback_Stub
#define HAL_UART_ErrorCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_ErrorCallback requires _Ignore (not AndReturn)");
#define HAL_UART_ErrorCallback_Ignore() HAL_UART_ErrorCallback_CMockIgnore()
void HAL_UART_ErrorCallback_CMockIgnore(void);
#define HAL_UART_ErrorCallback_StopIgnore() HAL_UART_ErrorCallback_CMockStopIgnore()
void HAL_UART_ErrorCallback_CMockStopIgnore(void);
#define HAL_UART_ErrorCallback_ExpectAndReturn(huart, cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_ErrorCallback requires _Expect (not AndReturn)");
#define HAL_UART_ErrorCallback_Expect(huart) HAL_UART_ErrorCallback_CMockExpect(__LINE__, huart)
void HAL_UART_ErrorCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart);
typedef void (* CMOCK_HAL_UART_ErrorCallback_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_ErrorCallback_AddCallback(CMOCK_HAL_UART_ErrorCallback_CALLBACK Callback);
void HAL_UART_ErrorCallback_Stub(CMOCK_HAL_UART_ErrorCallback_CALLBACK Callback);
#define HAL_UART_ErrorCallback_StubWithCallback HAL_UART_ErrorCallback_Stub
#define HAL_UART_AbortCpltCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_AbortCpltCallback requires _Ignore (not AndReturn)");
#define HAL_UART_AbortCpltCallback_Ignore() HAL_UART_AbortCpltCallback_CMockIgnore()
void HAL_UART_AbortCpltCallback_CMockIgnore(void);
#define HAL_UART_AbortCpltCallback_StopIgnore() HAL_UART_AbortCpltCallback_CMockStopIgnore()
void HAL_UART_AbortCpltCallback_CMockStopIgnore(void);
#define HAL_UART_AbortCpltCallback_ExpectAndReturn(huart, cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_AbortCpltCallback requires _Expect (not AndReturn)");
#define HAL_UART_AbortCpltCallback_Expect(huart) HAL_UART_AbortCpltCallback_CMockExpect(__LINE__, huart)
void HAL_UART_AbortCpltCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart);
typedef void (* CMOCK_HAL_UART_AbortCpltCallback_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_AbortCpltCallback_AddCallback(CMOCK_HAL_UART_AbortCpltCallback_CALLBACK Callback);
void HAL_UART_AbortCpltCallback_Stub(CMOCK_HAL_UART_AbortCpltCallback_CALLBACK Callback);
#define HAL_UART_AbortCpltCallback_StubWithCallback HAL_UART_AbortCpltCallback_Stub
#define HAL_UART_AbortTransmitCpltCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_AbortTransmitCpltCallback requires _Ignore (not AndReturn)");
#define HAL_UART_AbortTransmitCpltCallback_Ignore() HAL_UART_AbortTransmitCpltCallback_CMockIgnore()
void HAL_UART_AbortTransmitCpltCallback_CMockIgnore(void);
#define HAL_UART_AbortTransmitCpltCallback_StopIgnore() HAL_UART_AbortTransmitCpltCallback_CMockStopIgnore()
void HAL_UART_AbortTransmitCpltCallback_CMockStopIgnore(void);
#define HAL_UART_AbortTransmitCpltCallback_ExpectAndReturn(huart, cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_AbortTransmitCpltCallback requires _Expect (not AndReturn)");
#define HAL_UART_AbortTransmitCpltCallback_Expect(huart) HAL_UART_AbortTransmitCpltCallback_CMockExpect(__LINE__, huart)
void HAL_UART_AbortTransmitCpltCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart);
typedef void (* CMOCK_HAL_UART_AbortTransmitCpltCallback_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_AbortTransmitCpltCallback_AddCallback(CMOCK_HAL_UART_AbortTransmitCpltCallback_CALLBACK Callback);
void HAL_UART_AbortTransmitCpltCallback_Stub(CMOCK_HAL_UART_AbortTransmitCpltCallback_CALLBACK Callback);
#define HAL_UART_AbortTransmitCpltCallback_StubWithCallback HAL_UART_AbortTransmitCpltCallback_Stub
#define HAL_UART_AbortReceiveCpltCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_AbortReceiveCpltCallback requires _Ignore (not AndReturn)");
#define HAL_UART_AbortReceiveCpltCallback_Ignore() HAL_UART_AbortReceiveCpltCallback_CMockIgnore()
void HAL_UART_AbortReceiveCpltCallback_CMockIgnore(void);
#define HAL_UART_AbortReceiveCpltCallback_StopIgnore() HAL_UART_AbortReceiveCpltCallback_CMockStopIgnore()
void HAL_UART_AbortReceiveCpltCallback_CMockStopIgnore(void);
#define HAL_UART_AbortReceiveCpltCallback_ExpectAndReturn(huart, cmock_retval) TEST_FAIL_MESSAGE("HAL_UART_AbortReceiveCpltCallback requires _Expect (not AndReturn)");
#define HAL_UART_AbortReceiveCpltCallback_Expect(huart) HAL_UART_AbortReceiveCpltCallback_CMockExpect(__LINE__, huart)
