Anas388800/stm32/tests/build/test/mocks/test_start_servo_control_task/mock_stm32f4xx_hal_uart.h
void HAL_UART_AbortReceiveCpltCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart);
typedef void (* CMOCK_HAL_UART_AbortReceiveCpltCallback_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_AbortReceiveCpltCallback_AddCallback(CMOCK_HAL_UART_AbortReceiveCpltCallback_CALLBACK Callback);
void HAL_UART_AbortReceiveCpltCallback_Stub(CMOCK_HAL_UART_AbortReceiveCpltCallback_CALLBACK Callback);
#define HAL_UART_AbortReceiveCpltCallback_StubWithCallback HAL_UART_AbortReceiveCpltCallback_Stub
#define HAL_UARTEx_RxEventCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_UARTEx_RxEventCallback requires _Ignore (not AndReturn)");
#define HAL_UARTEx_RxEventCallback_Ignore() HAL_UARTEx_RxEventCallback_CMockIgnore()
void HAL_UARTEx_RxEventCallback_CMockIgnore(void);
#define HAL_UARTEx_RxEventCallback_StopIgnore() HAL_UARTEx_RxEventCallback_CMockStopIgnore()
void HAL_UARTEx_RxEventCallback_CMockStopIgnore(void);
#define HAL_UARTEx_RxEventCallback_ExpectAndReturn(huart, Size, cmock_retval) TEST_FAIL_MESSAGE("HAL_UARTEx_RxEventCallback requires _Expect (not AndReturn)");
#define HAL_UARTEx_RxEventCallback_Expect(huart, Size) HAL_UARTEx_RxEventCallback_CMockExpect(__LINE__, huart, Size)
void HAL_UARTEx_RxEventCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint16_t Size);
typedef void (* CMOCK_HAL_UARTEx_RxEventCallback_CALLBACK)(UART_HandleTypeDef* huart, uint16_t Size, int cmock_num_calls);
void HAL_UARTEx_RxEventCallback_AddCallback(CMOCK_HAL_UARTEx_RxEventCallback_CALLBACK Callback);
void HAL_UARTEx_RxEventCallback_Stub(CMOCK_HAL_UARTEx_RxEventCallback_CALLBACK Callback);
#define HAL_UARTEx_RxEventCallback_StubWithCallback HAL_UARTEx_RxEventCallback_Stub
#define HAL_LIN_SendBreak_Ignore() TEST_FAIL_MESSAGE("HAL_LIN_SendBreak requires _IgnoreAndReturn");
#define HAL_LIN_SendBreak_IgnoreAndReturn(cmock_retval) HAL_LIN_SendBreak_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_LIN_SendBreak_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_LIN_SendBreak_StopIgnore() HAL_LIN_SendBreak_CMockStopIgnore()
void HAL_LIN_SendBreak_CMockStopIgnore(void);
#define HAL_LIN_SendBreak_Expect(huart) TEST_FAIL_MESSAGE("HAL_LIN_SendBreak requires _ExpectAndReturn");
#define HAL_LIN_SendBreak_ExpectAndReturn(huart, cmock_retval) HAL_LIN_SendBreak_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_LIN_SendBreak_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_LIN_SendBreak_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_LIN_SendBreak_AddCallback(CMOCK_HAL_LIN_SendBreak_CALLBACK Callback);
void HAL_LIN_SendBreak_Stub(CMOCK_HAL_LIN_SendBreak_CALLBACK Callback);
#define HAL_LIN_SendBreak_StubWithCallback HAL_LIN_SendBreak_Stub
#define HAL_MultiProcessor_EnterMuteMode_Ignore() TEST_FAIL_MESSAGE("HAL_MultiProcessor_EnterMuteMode requires _IgnoreAndReturn");
#define HAL_MultiProcessor_EnterMuteMode_IgnoreAndReturn(cmock_retval) HAL_MultiProcessor_EnterMuteMode_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_MultiProcessor_EnterMuteMode_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_MultiProcessor_EnterMuteMode_StopIgnore() HAL_MultiProcessor_EnterMuteMode_CMockStopIgnore()
void HAL_MultiProcessor_EnterMuteMode_CMockStopIgnore(void);
#define HAL_MultiProcessor_EnterMuteMode_Expect(huart) TEST_FAIL_MESSAGE("HAL_MultiProcessor_EnterMuteMode requires _ExpectAndReturn");
#define HAL_MultiProcessor_EnterMuteMode_ExpectAndReturn(huart, cmock_retval) HAL_MultiProcessor_EnterMuteMode_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_MultiProcessor_EnterMuteMode_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_MultiProcessor_EnterMuteMode_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_MultiProcessor_EnterMuteMode_AddCallback(CMOCK_HAL_MultiProcessor_EnterMuteMode_CALLBACK Callback);
void HAL_MultiProcessor_EnterMuteMode_Stub(CMOCK_HAL_MultiProcessor_EnterMuteMode_CALLBACK Callback);
#define HAL_MultiProcessor_EnterMuteMode_StubWithCallback HAL_MultiProcessor_EnterMuteMode_Stub
#define HAL_MultiProcessor_ExitMuteMode_Ignore() TEST_FAIL_MESSAGE("HAL_MultiProcessor_ExitMuteMode requires _IgnoreAndReturn");
#define HAL_MultiProcessor_ExitMuteMode_IgnoreAndReturn(cmock_retval) HAL_MultiProcessor_ExitMuteMode_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_MultiProcessor_ExitMuteMode_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_MultiProcessor_ExitMuteMode_StopIgnore() HAL_MultiProcessor_ExitMuteMode_CMockStopIgnore()
void HAL_MultiProcessor_ExitMuteMode_CMockStopIgnore(void);
#define HAL_MultiProcessor_ExitMuteMode_Expect(huart) TEST_FAIL_MESSAGE("HAL_MultiProcessor_ExitMuteMode requires _ExpectAndReturn");
#define HAL_MultiProcessor_ExitMuteMode_ExpectAndReturn(huart, cmock_retval) HAL_MultiProcessor_ExitMuteMode_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_MultiProcessor_ExitMuteMode_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_MultiProcessor_ExitMuteMode_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_MultiProcessor_ExitMuteMode_AddCallback(CMOCK_HAL_MultiProcessor_ExitMuteMode_CALLBACK Callback);
void HAL_MultiProcessor_ExitMuteMode_Stub(CMOCK_HAL_MultiProcessor_ExitMuteMode_CALLBACK Callback);
#define HAL_MultiProcessor_ExitMuteMode_StubWithCallback HAL_MultiProcessor_ExitMuteMode_Stub
#define HAL_HalfDuplex_EnableTransmitter_Ignore() TEST_FAIL_MESSAGE("HAL_HalfDuplex_EnableTransmitter requires _IgnoreAndReturn");
#define HAL_HalfDuplex_EnableTransmitter_IgnoreAndReturn(cmock_retval) HAL_HalfDuplex_EnableTransmitter_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_HalfDuplex_EnableTransmitter_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_HalfDuplex_EnableTransmitter_StopIgnore() HAL_HalfDuplex_EnableTransmitter_CMockStopIgnore()
void HAL_HalfDuplex_EnableTransmitter_CMockStopIgnore(void);
#define HAL_HalfDuplex_EnableTransmitter_Expect(huart) TEST_FAIL_MESSAGE("HAL_HalfDuplex_EnableTransmitter requires _ExpectAndReturn");
#define HAL_HalfDuplex_EnableTransmitter_ExpectAndReturn(huart, cmock_retval) HAL_HalfDuplex_EnableTransmitter_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_HalfDuplex_EnableTransmitter_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_HalfDuplex_EnableTransmitter_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_HalfDuplex_EnableTransmitter_AddCallback(CMOCK_HAL_HalfDuplex_EnableTransmitter_CALLBACK Callback);
void HAL_HalfDuplex_EnableTransmitter_Stub(CMOCK_HAL_HalfDuplex_EnableTransmitter_CALLBACK Callback);
#define HAL_HalfDuplex_EnableTransmitter_StubWithCallback HAL_HalfDuplex_EnableTransmitter_Stub
#define HAL_HalfDuplex_EnableReceiver_Ignore() TEST_FAIL_MESSAGE("HAL_HalfDuplex_EnableReceiver requires _IgnoreAndReturn");
#define HAL_HalfDuplex_EnableReceiver_IgnoreAndReturn(cmock_retval) HAL_HalfDuplex_EnableReceiver_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_HalfDuplex_EnableReceiver_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_HalfDuplex_EnableReceiver_StopIgnore() HAL_HalfDuplex_EnableReceiver_CMockStopIgnore()
void HAL_HalfDuplex_EnableReceiver_CMockStopIgnore(void);
#define HAL_HalfDuplex_EnableReceiver_Expect(huart) TEST_FAIL_MESSAGE("HAL_HalfDuplex_EnableReceiver requires _ExpectAndReturn");
#define HAL_HalfDuplex_EnableReceiver_ExpectAndReturn(huart, cmock_retval) HAL_HalfDuplex_EnableReceiver_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_HalfDuplex_EnableReceiver_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_HalfDuplex_EnableReceiver_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_HalfDuplex_EnableReceiver_AddCallback(CMOCK_HAL_HalfDuplex_EnableReceiver_CALLBACK Callback);
void HAL_HalfDuplex_EnableReceiver_Stub(CMOCK_HAL_HalfDuplex_EnableReceiver_CALLBACK Callback);
#define HAL_HalfDuplex_EnableReceiver_StubWithCallback HAL_HalfDuplex_EnableReceiver_Stub
#define HAL_UART_GetState_Ignore() TEST_FAIL_MESSAGE("HAL_UART_GetState requires _IgnoreAndReturn");
#define HAL_UART_GetState_IgnoreAndReturn(cmock_retval) HAL_UART_GetState_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_GetState_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_UART_StateTypeDef cmock_to_return);
#define HAL_UART_GetState_StopIgnore() HAL_UART_GetState_CMockStopIgnore()
void HAL_UART_GetState_CMockStopIgnore(void);
#define HAL_UART_GetState_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_GetState requires _ExpectAndReturn");
#define HAL_UART_GetState_ExpectAndReturn(huart, cmock_retval) HAL_UART_GetState_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_GetState_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_UART_StateTypeDef cmock_to_return);
typedef HAL_UART_StateTypeDef (* CMOCK_HAL_UART_GetState_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_GetState_AddCallback(CMOCK_HAL_UART_GetState_CALLBACK Callback);
void HAL_UART_GetState_Stub(CMOCK_HAL_UART_GetState_CALLBACK Callback);
#define HAL_UART_GetState_StubWithCallback HAL_UART_GetState_Stub
#define HAL_UART_GetError_Ignore() TEST_FAIL_MESSAGE("HAL_UART_GetError requires _IgnoreAndReturn");
#define HAL_UART_GetError_IgnoreAndReturn(cmock_retval) HAL_UART_GetError_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_GetError_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
#define HAL_UART_GetError_StopIgnore() HAL_UART_GetError_CMockStopIgnore()
void HAL_UART_GetError_CMockStopIgnore(void);
#define HAL_UART_GetError_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_GetError requires _ExpectAndReturn");
#define HAL_UART_GetError_ExpectAndReturn(huart, cmock_retval) HAL_UART_GetError_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_GetError_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint32_t cmock_to_return);
typedef uint32_t (* CMOCK_HAL_UART_GetError_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_GetError_AddCallback(CMOCK_HAL_UART_GetError_CALLBACK Callback);
void HAL_UART_GetError_Stub(CMOCK_HAL_UART_GetError_CALLBACK Callback);
#define HAL_UART_GetError_StubWithCallback HAL_UART_GetError_Stub
#define UART_Start_Receive_IT_Ignore() TEST_FAIL_MESSAGE("UART_Start_Receive_IT requires _IgnoreAndReturn");
#define UART_Start_Receive_IT_IgnoreAndReturn(cmock_retval) UART_Start_Receive_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void UART_Start_Receive_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define UART_Start_Receive_IT_StopIgnore() UART_Start_Receive_IT_CMockStopIgnore()
void UART_Start_Receive_IT_CMockStopIgnore(void);
#define UART_Start_Receive_IT_Expect(huart, pData, Size) TEST_FAIL_MESSAGE("UART_Start_Receive_IT requires _ExpectAndReturn");
#define UART_Start_Receive_IT_ExpectAndReturn(huart, pData, Size, cmock_retval) UART_Start_Receive_IT_CMockExpectAndReturn(__LINE__, huart, pData, Size, cmock_retval)
void UART_Start_Receive_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_UART_Start_Receive_IT_CALLBACK)(UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, int cmock_num_calls);
void UART_Start_Receive_IT_AddCallback(CMOCK_UART_Start_Receive_IT_CALLBACK Callback);
void UART_Start_Receive_IT_Stub(CMOCK_UART_Start_Receive_IT_CALLBACK Callback);
#define UART_Start_Receive_IT_StubWithCallback UART_Start_Receive_IT_Stub
#define UART_Start_Receive_DMA_Ignore() TEST_FAIL_MESSAGE("UART_Start_Receive_DMA requires _IgnoreAndReturn");
#define UART_Start_Receive_DMA_IgnoreAndReturn(cmock_retval) UART_Start_Receive_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void UART_Start_Receive_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define UART_Start_Receive_DMA_StopIgnore() UART_Start_Receive_DMA_CMockStopIgnore()
void UART_Start_Receive_DMA_CMockStopIgnore(void);
#define UART_Start_Receive_DMA_Expect(huart, pData, Size) TEST_FAIL_MESSAGE("UART_Start_Receive_DMA requires _ExpectAndReturn");
#define UART_Start_Receive_DMA_ExpectAndReturn(huart, pData, Size, cmock_retval) UART_Start_Receive_DMA_CMockExpectAndReturn(__LINE__, huart, pData, Size, cmock_retval)
void UART_Start_Receive_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_UART_Start_Receive_DMA_CALLBACK)(UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, int cmock_num_calls);
void UART_Start_Receive_DMA_AddCallback(CMOCK_UART_Start_Receive_DMA_CALLBACK Callback);
void UART_Start_Receive_DMA_Stub(CMOCK_UART_Start_Receive_DMA_CALLBACK Callback);
#define UART_Start_Receive_DMA_StubWithCallback UART_Start_Receive_DMA_Stub

#ifdef __cplusplus
}
#endif

#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic pop
#endif
#endif

#endif
